[{"author" : "Susan B. Anthony", "quote" : "There shall never be another season of silence until women have the same rights men have on this green earth.
"}, {"author" : "Amy Poehler", "quote" : "I just love bossy women. I could be around them all day. To me, bossy is not a pejorative term at all. It means somebody’s passionate and engaged and ambitious and doesn’t mind leading.
"}, {"author" : "Ruth Bader Ginsburg", "quote" : "Women will only have true equality when men share with them the responsibility of bringing up the next generation.
"}, {"author" : "Ani DiFranco", "quote" : "My idea of feminism is self-determination, and it’s very open-ended: every woman has the right to become herself, and do whatever she needs to do.
"}, {"author" : "Margaret Cho", "quote" : "Ugly is irrelevant. It is an immeasurable insult to a woman, and then supposedly the worst crime you can commit as a woman. But ugly, as beautiful, is an illusion.
"}, {"author" : "Tina Fey", "quote" : "Do your thing and don’t care if they like it.
"}, {"author" : "Sue Monk Kidd", "quote" : "How could I choose someone who would force me to give up my own small reach for meaning? I chose myself, and without consolation.
"}, {"author" : "Christiane Amanpour", "quote" : "Because if we the storytellers don’t do this, then the bad people will win.
"}, {"author" : "Chimamanda Ngozi Adichie", "quote" : "Of course I am not worried about intimidating men. The type of man who will be intimidated by me is exactly the type of man I have no interest in.
"}, {"author" : "Junie B. Jones", "quote" : "Girls can be anything guys can be!
"}, {"author" : "Charlotte Whitton", "quote" : "Whatever women do they must do twice as well as men to be thought half as good. Luckily, this is not difficult.
"}, {"author" : "Mindy Kaling", "quote" : "I never want to be called the funniest Indian female comedian that exists. I feel like I can go head-to-head with the best white, male comedy writers that are out there. Why would I want to self-categorize myself into a smaller group than I’m able to compete in?
"}, {"author" : "Aung San Suu Kyi", "quote" : "If you’re feeling helpless, help someone.
"}, {"author" : "Margaret Thatcher", "quote" : "If you want something said, ask a man; if you want something done, ask a woman.
"}, {"author" : "Janelle Monáe", "quote" : "I feel myself becoming the fearless person I have dreamt of being. Have I arrived? No. But I’m constantly evolving and challenging myself to be unafraid to make mistakes.
"}, {"author" : "Gloria Steinem", "quote" : "Any woman who chooses to behave like a full human being should be warned that the armies of the status quo will treat her as something of a dirty joke. She will need her sisterhood.
"}, {"author" : "Angelina Jolie", "quote" : "I realized that very young — that a life where you don’t live to your full potential, or you don’t experiment, or you’re afraid, or you hesitate, or there are things you know you should do but you just don’t get around to them, is a life that I’d be miserable living, and the only way to feel that I’m on the right path is just to be true to myself, whatever that may be, and that tends to come with stepping out of something that’s maybe safe or traditional.
"}, {"author" : "Gloria Allred", "quote" : "There are some people who still feel threatened by strong women. That’s their problem. It’s not mine.
"}, {"author" : "Kristen Wiig", "quote" : "If you’re creating anything at all, it’s really dangerous to care about what people think.
"}, {"author" : "Diane Sawyer", "quote" : "Whatever you want in life, other people are going to want it too. Believe in yourself enough to accept the idea that you have an equal right to it.
"}, {"author" : "Maya Angelou", "quote" : "I’ve learned that people will forget what you said, people will forget what you did, but people will never forget how you made them feel.
"}, {"author" : "Dolly Parton", "quote" : "I’m not going to limit myself just because people won’t accept the fact that I can do something else.
"}, {"author" : "Sonia Johnson", "quote" : "I am a warrior in the time of women warriors; the longing for justice is the sword I carry.
"}, {"author" : "Diane Von Furstenberg", "quote" : "I wanted to be an independent woman, a woman who could pay for her bills, a woman who could run her own life — and I became that woman.
"}, {"author" : "Nicki Minaj", "quote" : "When you’re a girl, you have to be everything. You have to be dope at what you do, but you have to be super sweet, and you have to be sexy, and you have to be this and you have to be that and you have to be nice, and you have to — it’s like, I can’t be all of those things at once. I’m a human being.
"}, {"author" : "Louisa May Alcott", "quote" : "The emerging woman…will be strong-minded, strong-hearted, strong-souled, and strong-bodied…strength and beauty must go together.
"}, {"author" : "Zooey Deschanel", "quote" : "I don’t know why femininity should be associated with weakness. Women should be free to express who they are without thinking, ‘I need to act like a man, or I need to tone it down to be successful.’ That’s a very good way to keep women down.
"}, {"author" : "Nora Ephron", "quote" : "Above all, be the heroine of your life, not the victim.
"}, {"author" : "Grace Hopper", "quote" : "I had a running compiler and nobody would touch it. … they carefully told me, computers could only do arithmetic; they could not do programs.
"}, {"author" : "Marie Curie", "quote" : "Life is not easy for any of us. But what of that? We must have perseverance and above all confidence in ourselves. We must believe that we are gifted for something and that this thing must be attained.
"}, {"author" : "Simone de Beauvoir", "quote" : "The point is not for women simply to take power out of men’s hands, since that wouldn’t change anything about the world. It’s a question precisely of destroying that notion of power.
"}, {"author" : "Barbra Streisand", "quote" : "Men are allowed to have passion and commitment for their work… a woman is allowed that feeling for a man, but not her work.
"}, {"author" : "Ayn Rand", "quote" : "The question isn't who's going to let me; it's who's going to stop me.
"}, {"author" : "Angela Merkel", "quote" : "I never underestimated myself. And I never saw anything wrong with ambition.
"}, {"author" : "J.K. Rowling", "quote" : "It is impossible to live without failing at something, unless you live so cautiously that you might as well not have lived at all, in which case you have failed by default.
"}, {"author" : "Jane Goodall", "quote" : "My family has very strong women. My mother never laughed at my dream of Africa, even though everyone else did because we didn’t have any money, because Africa was the ‘dark continent’, and because I was a girl.
"}, {"author" : "Toni Morrison", "quote" : "I merged those two words, black and feminist, because I was surrounded by black women who were very tough and and who always assumed they had to work and rear children and manage homes.
"}, {"author" : "Margaret Sanger", "quote" : "No woman can call herself free who does not control her own body.
"}, {"author" : "Serena Williams", "quote" : "I love who I am, and I encourage other people to love and embrace who they are. But it definitely wasn’t easy — it took me a while.
"}, {"author" : "Amelia Earhart", "quote" : "Now and then women should do for themselves what men have already done—occasionally what men have not done—thereby establishing themselves as persons, and perhaps encouraging other women toward greater independence of thought and action.
"}, {"author" : "Oprah Winfrey", "quote" : "Think like a queen. A queen is not afraid to fail. Failure is another steppingstone to greatness.
"}, {"author" : "Emmeline Pankhurst", "quote" : "I had to get a close-hand view of the misery and unhappiness of a man made world, before I reached the point where I could successfully revolt against it.
"}, {"author" : "Emma Watson", "quote" : "Young girls are told you have to be the delicate princess. Hermione taught them that you can be the warrior.
"}, {"author" : "Janet Mock", "quote" : "Sometimes people try to destroy you, precisely because they recognize your power — not because they don’t see it, but because they see it and they don’t want it to exist.
"}, {"author" : "Roseanne Barr", "quote" : "The thing women have yet to learn is nobody gives you power. You just take it.
"}, {"author" : "Ginger Rogers", "quote" : "There’s nothing a man can do, that I can’t do better and in heels.
"}, {"author" : "Beyoncé", "quote" : "Who runs the world? Girls.
"}, {"author" : "Barbara Walters", "quote" : "This is what I tell, especially young women, fight the big fights. Don’t fight the little fight… Be the first one in, be the last one out. Do your homework, choose your battles. Don’t whine, and don’t be the one who complains about everything. Fight the big fight.
"}, {"author" : "Michelle Obama", "quote" : "One of the lessons that I grew up with was to always stay true to yourself and never let what somebody else says distract you from your goals. And so when I hear about negative and false attacks, I really don’t invest any energy in them, because I know who I am.
"}, {"author" : "Coco Chanel", "quote" : "The most courageous act is still to think for yourself. Aloud.
"}, {"author" : "Sojourner Truth", "quote" : "If women want rights more than they got, why don’t they just take them, and not be talking about it.
"}, {"author" : "Sheryl Sandberg", "quote" : "In the future, there will be no female leaders. There will just be leaders.
"}, {"author" : "Laverne Cox", "quote" : "I think transwomen, and transpeople in general, show everyone that you can define what it means to be a man or woman on your own terms. A lot of what feminism is about is moving outside of roles and moving outside of expectations of who and what you're supposed to be to live a more authentic life.
"}, {"author" : "Marissa Mayer", "quote" : "I love technology, and I don’t think it’s something that should divide along gender lines.
"}, {"author" : "Jennifer Lawrence", "quote" : "I’m never going to starve myself for a part.I don’t want little girls to be like, ‘Oh, I want to look like Katniss, so I’m going to skip dinner.’ That’s something I was really conscious of during training, when you’re trying to get your body to look exactly right. I was trying to get my body to look fit and strong — not thin and underfed.
"}, {"author" : "Sophia Amoruso", "quote" : "Bad bitches are taking over the world.
"}, {"author" : "Elizabeth Cady Stanton", "quote" : "I would have girls regard themselves not as adjectives but as nouns.
"}, {"author" : "Shonda Rhimes", "quote" : "At some point, you have to make a decision. Boundaries don’t keep other people out. They fence you in. Life is messy. That’s how we’re made. So, you can waste your lives drawing lines. Or you can live your life crossing them.
"}, {"author" : "bell hooks", "quote" : "If any female feels she needs anything beyond herself to legitimate and validate her existence, she is already giving away her power to be self-defining, her agency.
"}, {"author" : "Mary Harris Jones", "quote" : "I’m not a humanitarian, I’m a hell-raiser.
"}, ]